app/views/sucursal/edit.html.erb

                                                <label>Giro</label>
                                                <%= f.collection_select(:giro_id, Giro.order('id'), :id, :actividad, { :prompt => 'Seleccione'}, {class: 'form-control'}) %>
---
SELECT `giros`.* FROM `giros` ORDER BY id