app/views/sucursal/new.html.erb

SELECT `giros`.* FROM `giros` ORDER BY id
---
                                                <label>Giro</label>
                                                <%= f.collection_select(:giro_id, Giro.order('id'), :id, :actividad, { :prompt => 'Seleccione'}, {class: 'form-control'}) %>