app/controllers/pedidos_controller.rb

  def index
    @pedidos = Pedido.all
---
SELECT `pedidos`.* FROM `pedidos`

  def create
    @pedido = Pedido.new(pedido_params)

    respond_to do |format|
      if @pedido.save
---
INSERT INTO `pedidos` (`idUsuario`, `mesa`, `costo`, `idEstadoComanda`, `fecha`, `descripcion`, `created_at`, `updated_at`) VALUES (1, 7, 3000, 1, '2019-05-30', 'wena venta', '2019-05-30 23:50:55', '2019-05-30 23:50:55')

    def set_pedido
      @pedido = Pedido.find(params[:id])
---
SELECT  `pedidos`.* FROM `pedidos` WHERE `pedidos`.`id` = 1 LIMIT 1