app/controllers/platos_controller.rb

SELECT `platos`.* FROM `platos`
---
  def index
    @platos = Plato.all

INSERT INTO `platos` (`nombre`, `costo`, `disponible`, `created_at`, `updated_at`) VALUES ('Porotos con mazamorra', 1200, 1, '2019-05-30 23:49:34', '2019-05-30 23:49:34')
---
  def create
    @plato = Plato.new(plato_params)

    respond_to do |format|
      if @plato.save

SELECT  `platos`.* FROM `platos` WHERE `platos`.`id` = 1 LIMIT 1
---
    def set_plato
      @plato = Plato.find(params[:id])