app/controllers/plato_pedidos_controller.rb

  def index
    @plato_pedidos = PlatoPedido.all
---
SELECT `plato_pedidos`.* FROM `plato_pedidos`

  def create
    @plato_pedido = PlatoPedido.new(plato_pedido_params)


    respond_to do |format|
      if @plato_pedido.save
---
INSERT INTO `plato_pedidos` (`plato_id`, `pedido_id`, `created_at`, `updated_at`) VALUES (2, 1, '2019-05-30 23:51:11', '2019-05-30 23:51:11')

    def set_plato_pedido
      @plato_pedido = PlatoPedido.find(params[:id])
---
SELECT  `pedidos`.* FROM `pedidos` WHERE `pedidos`.`id` = 1 LIMIT 1
SELECT  `plato_pedidos`.* FROM `plato_pedidos` WHERE `plato_pedidos`.`id` = 1 LIMIT 1