app/controllers/sucursal_controller.rb

	def index
		@sucursals = Sucursal.all
---
SELECT `sucursals`.* FROM `sucursals`

	def create
		@sucursal = Sucursal.new(sucursal_params);
		if @sucursal.save
---
INSERT INTO `sucursals` (`rut`, `nombre`, `nro_fiscal`, `fono1`, `fono2`, `giro_id`, `razon_social`, `direccion`, `numero`, `descripcion`) VALUES (123123, 'Donde Nachito', 123123, 4123123, 213123, 561000, 'Donde Nachito S.A', 'Su casa', 123, 'Terrible malo el restauran')

	def update
		@sucursal = Sucursal.find(params[:id])
		if @sucursal.update(sucursal_params)
---
UPDATE `sucursals` SET `razon_social` = 'Donde Nachito S.A.' WHERE `sucursals`.`rut` = 123123